tutorials/multiphase/solidificationFoam/SMACS_I/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices        
(
    (0 0 0)
    (5 0 0)
    (5 6 0)
    (0 6 0)
    (0 0 0.1)
    (5 0 0.1)
    (5 6 0.1)
    (0 6 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (200 240 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    
    left
    {
        type symmetryPlane;
        faces
        (
            (0 4 7 3)
        );
    }
    
    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
